---
kind: property
id: P:Autodesk.Revit.DB.FilteredElementIdIterator.CurrentObject
source: html/ca23ad34-a750-7156-f0c1-5295ccf4a582.htm
---
# Autodesk.Revit.DB.FilteredElementIdIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```